#!/bin/bash

# نمایش هدر با فونت بزرگ
figlet -f block "موسسه مالی و اعتباری رسالت"

echo "استعلام تسهیلات مشتری"
read -p "کد ملی مشتری را وارد کنید: " code

if [ "$code" == "3330227796" ]; then
    echo "-----------------------------------"
    echo "مشتری: سجاد شریفی"
    echo "تسهیلات تسویه نشده :1 مورد شماره تسهیلات ****۷۵۸- تعداد تسهیلات تسویه شده ۱ مورد ش.تسهیلات ۶۸۵"
    echo " مورد بدهی روز ۰ ریال تعداد اقساط باقیمانده ۱ قسظ
    1404/04/29مبلغ تا تسویه کلی تسهیلات110.560.000 ریال"
    echo "جهت چاپ کلید p را فشار دهید"
    echo "-----------------------------------"
elif [ "$code" == "3341394109" ]; then
    echo "-----------------------------------"
    echo "مشتری: عیسی شریفی"
    echo "تعداد تسهیلات: ۱ مورد"
    echo "بدهی فعلی: ۰ ریال"
    echo "جمع پرداختی: ۵۷۷٫۰۰۰٫۰۰۰ ریال"
    echo "-----------------------------------"
else
    echo -e "\e[31mخطا: کد ملی نامعتبر است!\e[0m"
   fi
   fi
