#!/bin/bash

# نمایش هدر با فونت بزرگ
figlet -f block "موسسه مالی و اعتباری رسالت"

echo "استعلام تسهیلات مشتری"
read -p "کد ملی مشتری را وارد کنید: " code

if [ "$code" == "3330227796" ]; then
    echo "-----------------------------------"
    echo "مشتری: سجاد شریفی"
    echo "تسهیلات تسویه نشده"
    echo "۲ مورد بدهی ۰ ریال"
    echo "باقیمانده تا تسویه ۲۷۸٫۶۵۰٫۰۰۰ ریال می باشد"
    echo "-----------------------------------"
elif [ "$code" == "3341394109" ]; then
    echo "-----------------------------------"
    echo "مشتری: عیسی شریفی"
    echo "تعداد تسهیلات: ۱ مورد"
    echo "بدهی فعلی: ۰ ریال"
    echo "جمع پرداختی: ۵۷۷٫۰۰۰٫۰۰۰ ریال"
    echo "-----------------------------------"
else
    echo -e "\e[31mخطا: کد ملی نامعتبر است!\e[0m"
fi